app/controllers/posts_controller.rb

SELECT * FROM `posts` ORDER BY created_at DESC LIMIT 0, 2
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
---
  def index
#    @posts = Post.paginate :all, :joins => "INNER JOIN `categories` ON categories.id= posts.category_id", :select => "posts.*,categories.category_name", :page => params[:page], :order => 'created_at DESC'
     @posts = Post.paginate :all, :page => params[:page], :order => 'created_at DESC'
      @categories  = Category.find(:all)